Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateRevealError Property
 Could not create Reveal. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRevealError { get; }
Public Shared ReadOnly Property CannotCreateRevealError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRevealError {
	FailureDefinitionId^ get ();
}
static member CannotCreateRevealError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace